{
	"s_StandardSettings": "Configuración estándar",
	"s_ReferalLink": "Si en este momento no eres un usuario de Tibber, te agradecemos mucho si usas nuestro enlace de referencia.",
	"s_TibberAPIToken": "Token para la API de Tibber",
	"s_HomesFeedTable": "Configuración de los flujos de datos en vivo de Pulse",
	"s_Home": "Casa Tibber",
	"s_PulseActive": "Usar Tibber Pulse para esta casa",
	"s_SelectFieldsForFeed": "Selecciona todos los campos que deseas cargar en los datos del feed (la potencia y la marca de tiempo son los valores predeterminados):",
	"s_PhasesExplanation": "Valores de voltaje y corriente - en varios medidores, estos valores no forman parte del marco de datos, por lo que los valores pueden ser nulos. Puede haber otras desviaciones basadas en el firmware del medidor concreto. Los valores nulos no generarán un estado en tus objetos ioBroker.",
	"s_CalculatorSettings": "Configuración de automatización",
	"s_CalculatorChannels": "Canales de automatización",
	"s_UseCalculator": "Usar automatización",
	"s_ChannelHome": "Canal Casa",
	"s_ChannelType": "Tipo de canal",
	"s_BestCost": "Mejor costo",
	"s_BestSingleHours": "Mejores horas individuales",
	"s_BestHoursBlock": "Mejor bloque de horas - No implementado",
	"s_Active": "Activo",
	"s_TargetState": "Estado objetivo",
	"s_ValueYES": "Valor SÍ",
	"s_ValueNO": "Valor NO",
	"s_CalculatorHelp1": "Los canales pueden activarse o desactivarse en un Estado correspondiente.",
	"s_CalculatorHelp2": "Todos los estados de un canal de calculadora se colocan cerca de los States de las viviendas y se nombran según el número del canal.",
	"s_CalculatorHelp3": "El comportamiento de un canal se define por su tipo: 'mejor costo'; 'mejores horas individuales' - aún no implementadas; 'mejor bloque de horas' - aún no implementado.",
	"s_CalculatorHelp4": "Cada canal tiene un Estado externo como salida, que se puede elegir en la pestaña de configuración. Este Estado podría ser, por ejemplo, '0_userdata.0.example_state' u cualquier otro Estado externo escribible.",
	"s_CalculatorHelp5": "Los valores que se deben escribir en el Estado de salida pueden definirse en 'valor SÍ' y 'valor NO', por ejemplo, 'true' para Estados booleanos o un número o texto a escribir.",
	"s_CalculatorHelp6": "Salidas:",
	"s_CalculatorHelp7": "'Mejor costo': Utiliza el estado 'PrecioGatillo' como entrada; la salida es 'SÍ' cada hora en que el costo actual de la energía Tibber esté por debajo del precio de gatillo.",
	"s_CalculatorHelp8": "'Mejores horas individuales' - aún no implementado.",
	"s_CalculatorHelp9": "'Mejor bloque de horas' - aún no implementado."
}
