{
    "DUMMY_CalculatorTab": "FICTICIO",
    "LBL_CalculatorTab": "Configuración de la calculadora",
    "LBL_UseCalculator": "Utilice canales de calculadora de automatización",
    "LBL_CalculatorList": "Canales de calculadora",
    "LBL_item_chHomeID": "Seleccionar ID de inicio del canal",
    "TTIP_item_chHomeID": "Seleccione la casa a la que se debe adjuntar este canal.",
    "LBL_item_chType": "Tipo de canal",
    "TTIP_item_chType": "Seleccione el tipo de operación para el canal.",
    "LBL_item_chType_option_1": "mejor costo",
    "LBL_item_chType_option_2": "mejores horas individuales",
    "LBL_item_chType_option_3": "bloque de mejores horas",
    "LBL_item_chType_option_4": "mejor costo LTF",
    "LBL_item_chType_option_5": "mejores horas individuales LTF",
    "LBL_item_chType_option_6": "bloque de mejores horas LTF",
    "LBL_item_chType_option_7": "buffer de batería inteligente",
    "LBL_item_chName": "Nombre del canal",
    "TTIP_item_chName": "Nombre del canal para ayudar a identificar sus estados más fácilmente.",
    "LBL_item_chTargetState": "Estado objetivo",
    "TTIP_item_chTargetState": "Seleccione el estado de salida objetivo para este canal. Si no se proporciona ninguno, se creará uno dentro de la carpeta del Canal.",
    "LBL_item_chValueOn": "Valor SI",
    "TTIP_item_chValueOn": "Los valores que se escribirán en el estado de salida se pueden definir como 'valor SÍ' y 'valor NO', por ejemplo, 'verdadero' para estados booleanos, o un número o texto a escribir.",
    "LBL_item_chValueOff": "Valor NO",
    "TTIP_item_chValueOff": "Los valores que se escribirán en el estado de salida se pueden definir como 'valor SÍ' y 'valor NO', por ejemplo, 'verdadero' para estados booleanos, o un número o texto a escribir.",
    "LBL_item_chTargetState2": "Estado objetivo 2",
    "TTIP_item_chTargetState2": "Seleccione el segundo estado de salida objetivo para este canal. Si no se proporciona ninguno, se creará uno nuevo dentro de la carpeta del Canal.",
    "LBL_item_chValueOn2": "Valor SÍ 2",
    "TTIP_item_chValueOn2": "Los valores que se escribirán en el segundo estado de salida se pueden definir como 'valor SÍ 2' y 'valor NO 2', por ejemplo, 'verdadero' para estados booleanos, o un número o texto a escribir.",
    "LBL_item_chValueOff2": "Valor NO 2",
    "TTIP_item_chValueOff2": "Los valores que se escribirán en el segundo estado de salida se pueden definir como 'valor SÍ 2' y 'valor NO 2', por ejemplo, 'verdadero' para estados booleanos, o un número o texto a escribir.",
    "LBL_calculatorhelp1": "Los canales se pueden activar o desactivar según el estado con nombre correspondiente.",
    "LBL_calculatorhelp2": "Todos los estados de un canal de calculadora están ubicados cerca de los estados de origen y están etiquetados con el número de canal.",
    "LBL_calculatorhelp3": "El comportamiento de un canal está determinado por su tipo: \"Mejor costo\", \"Mejores horas individuales\", \"Mejor bloque de horas\" o \"Búfer de batería inteligente\".",
    "LBL_calculatorhelp4": "Cada canal proporciona un estado externo como salida, que se puede seleccionar en la pestaña de configuración. Este estado podría ser, por ejemplo, '0_userdata.0.example_state' o cualquier otro estado externo grabable.",
    "LBL_calculatorhelp5": "Si no se selecciona ningún estado de salida externo, se generará un estado interno dentro del rango del canal.",
    "LBL_calculatorhelp6": "Los valores que se escribirán en el estado de salida se pueden definir como 'valor SÍ' y 'valor NO', por ejemplo, 'verdadero' para estados booleanos, o un número o texto que se escribirá.",
    "LBL_calculatorhelp7": "<b>Salidas:</b> Se definen los siguientes parámetros de salida:",
    "LBL_calculatorhelp8": "'Mejor costo': utiliza el objeto 'TriggerPrice' como entrada, generando una salida 'SÍ' cada hora cuando el costo actual de energía de Tibber está por debajo del precio de activación.",
    "LBL_calculatorhelp9": "'Mejores horas individuales': Genera una salida 'SÍ' durante las horas menos costosas, con el número de horas definido en el objeto 'AmountHours'.",
    "LBL_calculatorhelp10": "'Mejor bloque de horas': genera 'SÍ' durante el bloque de horas más rentable, con la duración especificada en el objeto 'AmountHours'.",
    "LBL_calculatorhelp11": "'Mejor costo LTF': 'Mejor costo' dentro de un marco de tiempo limitado (LTF).",
    "LBL_calculatorhelp12": "'Mejores horas individuales LTF': 'Mejores horas individuales' dentro de un período de tiempo limitado (LTF).",
    "LBL_calculatorhelp13": "'Bloque de mejores horas LTF': 'Bloque de mejores horas' dentro de un marco de tiempo limitado (LTF)",
    "LBL_calculatorhelp14": "'Smart Battery Buffer': utiliza el parámetro 'EfficiencyLoss' para especificar la pérdida de eficiencia del sistema de batería. El parámetro 'AmountHours' define el número deseado de horas para cargar la batería. La calculadora activará la carga de la batería ('valor SÍ') y desactivará la alimentación de la batería ('valor 2 NO') durante las 'Cantidad de Horas' especificadas de las horas más baratas. Por el contrario, desactivará la carga de baterías ('valor NO') y activará la alimentación de baterías ('valor 2 SI') durante las horas de mayor coste, siempre que el coste supere el precio total más alto entre las horas más económicas. Durante las horas normales restantes, cuando el almacenamiento de energía mediante la batería no sea económicamente viable, ambas salidas estarán apagadas.",
    "LBL_calculatorhelp15": "<b>Canales LTF:</b> Estos funcionan de manera similar a los canales estándar, pero están activos solo dentro de un período de tiempo definido por los objetos de estado 'StartTime' y 'StopTime'. Después de 'StopTime', el canal se desactiva automáticamente. 'StartTime' y 'StopTime' pueden abarcar dos días naturales, ya que Tibber no proporciona datos más allá de un período de 48 horas. Ambos estados requieren una cadena de fecha y hora en formato ISO-8601 con un desplazamiento de zona horaria, por ejemplo, '2024-12-24T18:00:00.000+01:00'.",
    "LBL_calculatorhelp16": "Además, los canales LTF incluyen un nuevo parámetro de estado llamado 'RepeatDays', que por defecto es 0. Cuando 'RepeatDays' se establece en un número entero positivo, el canal repite su ciclo incrementando tanto 'StartTime' como 'StopTime' en el número especificado. de días después de alcanzar el 'StopTime'. Por ejemplo, establezca 'RepeatDays' en 1 para la repetición diaria.",
    "DUMMY_StandardTab": "FICTICIO",
    "LBL_SpecialsTab": "Configuraciones especiales",
    "LBL_UseObsoleteStats": "Utilice una llamada API obsoleta para obtener datos de consumo históricos: ¡proceda con precaución!",
    "LBL_specialshelp1": "También recupera los valores de TotalCost, incluidas las tarifas especiales de la red en Alemania. Verifique los valores con los que se muestran en su aplicación Tibber.",
    "LBL_LocalPulseTab": "Configuración de sondeo de pulso local",
    "LBL_item_UseLocalPulseData": "Utilice el sondeo directo de los Tibber Pulse locales. ¡Proceda con precaución!",
    "LBL_item_localpulsehelp1": "Utilice su(s) puente(s) Tibber para sondear directamente los datos de su(s) módulo(s) Tibber Pulse localmente.",
    "LBL_item_localpulsehelp2": "Para que funcione, debe modificar la interfaz web de Bridge para mantenerla habilitada permanentemente.",
    "LBL_item_localpulsehelp3": "marq24 ha proporcionado una excelente descripción de cómo hacer esto para la integración de Home Assistant aquí:",
    "LBL_item_localpulsehelp4": "https://github.com/marq24/ha-tibber-pulse-local",
    "LBL_PulseList": "Pulso local para sondear datos de:"
}
