{
	"common": {
		"name": "tibberlink",
		"version": "3.4.7",
		"news": {
			"3.4.7": {
				"en": "adapter checker detected optimizations (#493)",
				"de": "Adapter-Checker erkannte Optimierungen (#493)",
				"ru": "оптимизации, обнаруженные проверяющим адаптера (#493)",
				"pt": "otimizações detectadas pelo verificador de adaptadores (#493)",
				"nl": "door adapter checker gedetecteerde optimalisaties (#493)",
				"fr": "optimisations détectées par le vérificateur d'adaptateurs (#493)",
				"it": "ottimizzazioni rilevate dal controllo dell'adattatore (#493)",
				"es": "optimizaciones detectadas por el verificador de adaptadores (#493)",
				"pl": "optymalizacje wykryte przez sprawdzanie adaptera (#493)",
				"uk": "оптимізації, виявлені перевіряючим адаптера (#493)",
				"zh-cn": "适配器检查器检测到的优化 (#493)"
			},
			"3.4.6": {
				"en": "Catch wrong OBIS Codes, probably caused by Pulse communication errors",
				"de": "Fange falsche OBIS-Codes ab, wahrscheinlich verursacht durch Pulse-Kommunikationsfehler",
				"ru": "Перехват неправильных кодов OBIS, вероятно, вызванных ошибками связи Pulse",
				"pt": "Capturar códigos OBIS incorretos, provavelmente causados por erros de comunicação Pulse",
				"nl": "Ongeldige OBIS-codes opvangen, waarschijnlijk veroorzaakt door Pulse-communicatiefouten",
				"fr": "Intercepter les codes OBIS incorrects, probablement causés par des erreurs de communication Pulse",
				"it": "Cattura codici OBIS errati, probabilmente causati da errori di comunicazione Pulse",
				"es": "Capturar códigos OBIS incorrectos, probablemente causados por errores de comunicación de Pulse",
				"pl": "Przechwyć nieprawidłowe kody OBIS, prawdopodobnie spowodowane błędami komunikacji Pulse",
				"uk": "Перехоплення неправильних OBIS-кодів, ймовірно, спричинених помилками зв'язку Pulse",
				"zh-cn": "捕获错误的 OBIS 代码，可能是由于 Pulse 通信错误引起的"
			},
			"3.4.5": {
				"en": "decode meter mode 4 for local Tibber Pulse poll (#477)\ndecode meter mode 1 for local Tibber Pulse poll (#478)\nfixed wrong Pulse local status names (voltage)\nadd docu on local Pulse poll config screen (#479)",
				"de": "Dekodiere Zählermodus 4 für lokale Tibber Pulse-Abfrage (#477)\nDekodiere Zählermodus 1 für lokale Tibber Pulse-Abfrage (#478)\nfalsche lokale Pulse-Statusnamen (Spannung) korrigiert\nDokumentation zum Konfigurationsbildschirm für lokale Pulse-Abfragen hinzugefügt (#479)",
				"ru": "декодировать режим счетчика 4 для локального опроса Tibber Pulse (#477)\nдекодировать режим счетчика 1 для локального опроса Tibber Pulse (#478)\nисправлены неверные локальные названия статусов Pulse (напряжение)\nдобавить документацию на экран конфигурации локального опроса Pulse (#479)",
				"pt": "decodificar modo de medidor 4 para pesquisa local do Tibber Pulse (#477)\ndecodificar modo de medidor 1 para pesquisa local do Tibber Pulse (#478)\nnomes de status locais do Pulse incorretos corrigidos (voltagem)\nadicionar documentação na tela de configuração de pesquisa local do Pulse (#479)",
				"nl": "decodeer meterstand 4 voor lokale Tibber Pulse-peiling (#477)\ndecodeer meterstand 1 voor lokale Tibber Pulse-peiling (#478)\nfoutieve lokale Pulstatusnamen (spanning) gecorrigeerd\ndocumentatie toevoegen op het configuratiescherm voor lokale Pulse-peiling (#479)",
				"fr": "décoder le mode compteur 4 pour le sondage local Tibber Pulse (#477)\ndécoder le mode compteur 1 pour le sondage local Tibber Pulse (#478)\nnoms de statuts locaux de Pulse incorrects corrigés (tension)\najouter de la documentation sur l'écran de configuration des sondages locaux de Pulse (#479)",
				"it": "decodificare la modalità del contatore 4 per il sondaggio locale di Tibber Pulse (#477)\ndecodificare la modalità del contatore 1 per il sondaggio locale di Tibber Pulse (#478)\ncorretti nomi di stato locali di Pulse errati (tensione)\naggiungere la documentazione sulla schermata di configurazione del sondaggio Pulse locale (#479)",
				"es": "decodificar el modo del medidor 4 para la encuesta local de Tibber Pulse (#477)\ndecodificar el modo del medidor 1 para la encuesta local de Tibber Pulse (#478)\nnombres de estados locales de Pulse corregidos (voltaje)\nagregar documentación en la pantalla de configuración de la encuesta de Pulse local (#479)",
				"pl": "dekodować tryb licznika 4 dla lokalnej ankiety Tibber Pulse (#477)\ndekodować tryb licznika 1 dla lokalnej ankiety Tibber Pulse (#478)\nnazwy lokalnych statusów Pulse (napięcie) naprawiono\ndodaj dokumentację na ekranie konfiguracji lokalnej ankiety Pulse (#479)",
				"uk": "декодувати режим лічильника 4 для локального опитування Tibber Pulse (#477)\nдекодувати режим лічильника 1 для локального опитування Tibber Pulse (#478)\nвиправлено неправильні локальні назви статусів Pulse (напруга)\nдодати документацію на екрані налаштувань локального опитування Pulse (#479)",
				"zh-cn": "解码本地 Tibber Pulse 轮询的仪表模式 4 (#477)\n解码本地 Tibber Pulse 轮询的仪表模式 1 (#478)\n修正错误的 Pulse 本地状态名称（电压）\n在本地 Pulse 轮询配置屏幕上添加文档 (#479)"
			},
			"3.4.4": {
				"en": "local poll of data - change units Wh to kWh and round to 0.1kWh (#469)",
				"de": "Lokale Abfrage von Daten - Einheiten von Wh in kWh ändern und auf 0,1 kWh runden (#469)",
				"ru": "локальный опрос данных - изменить единицы измерения с Втч на кВтч и округлить до 0,1 кВтч (#469)",
				"pt": "consulta local de dados - alterar unidades de Wh para kWh e arredondar para 0,1kWh (#469)",
				"nl": "lokale gegevenspoll - verander eenheden van Wh naar kWh en rond af naar 0,1 kWh (#469)",
				"fr": "sondage local de données - changer les unités de Wh en kWh et arrondir à 0,1kWh (#469)",
				"it": "sondaggio locale dei dati - cambiare le unità da Wh a kWh e arrotondare a 0,1 kWh (#469)",
				"es": "sondeo local de datos: cambiar unidades de Wh a kWh y redondear a 0,1kWh (#469)",
				"pl": "lokalne sondowanie danych - zmiana jednostek z Wh na kWh i zaokrąglenie do 0,1 kWh (#469)",
				"uk": "локальне опитування даних - змінити одиниці з Втч на кВтч та округлити до 0,1 кВтч (#469)",
				"zh-cn": "本地数据轮询 - 将单位从 Wh 更改为 kWh 并四舍五入到 0.1kWh (#469)"
			},
			"3.4.3": {
				"en": "added unit to Pulse temperature and round to 0.1°C\nadded unit to Pulse battery voltage and round to 100mV\nadded unit to Pulse uptime\nadded state with Pulse uptime as human readable string",
				"de": "Einheit zur Pulse-Temperatur hinzugefügt und auf 0,1°C gerundet\nEinheit zur Pulse-Batteriespannung hinzugefügt und auf 100mV gerundet\nEinheit zur Pulse-Betriebszeit hinzugefügt\nZustand mit Pulse-Betriebszeit als lesbaren String hinzugefügt",
				"ru": "добавлена единица измерения температуры Pulse и округление до 0,1°C\nдобавлена единица измерения напряжения батареи Pulse и округление до 100мВ\nдобавлена единица измерения времени работы Pulse\nдобавлено состояние с временем работы Pulse в виде читаемой строки",
				"pt": "adicionada unidade à temperatura do Pulse e arredondada para 0,1°C\nadicionada unidade à voltagem da bateria do Pulse e arredondada para 100mV\nadicionada unidade ao tempo de atividade do Pulse\nadicionado estado com tempo de atividade do Pulse como string legível",
				"nl": "eenheid toegevoegd aan Pulse-temperatuur en afgerond naar 0,1°C\neenheid toegevoegd aan Pulse-accuspanning en afgerond naar 100mV\neenheid toegevoegd aan Pulse-uptime\ntoestand toegevoegd met Pulse-uptime als leesbare string",
				"fr": "ajout de l'unité à la température du Pulse et arrondi à 0,1°C\najout de l'unité à la tension de la batterie du Pulse et arrondi à 100mV\najout de l'unité au temps de fonctionnement du Pulse\najout de l'état avec le temps de fonctionnement du Pulse sous forme de chaîne lisible",
				"it": "aggiunta unità alla temperatura Pulse e arrotondata a 0,1°C\naggiunta unità alla tensione della batteria Pulse e arrotondata a 100mV\naggiunta unità al tempo di attività Pulse\naggiunto stato con tempo di attività Pulse come stringa leggibile",
				"es": "se agregó unidad a la temperatura del Pulse y se redondeó a 0,1°C\nse agregó unidad al voltaje de la batería del Pulse y se redondeó a 100mV\nse agregó unidad al tiempo de actividad del Pulse\nse agregó estado con el tiempo de actividad del Pulse como cadena legible",
				"pl": "dodano jednostkę do temperatury Pulse i zaokrąglono do 0,1°C\ndodano jednostkę do napięcia baterii Pulse i zaokrąglono do 100mV\ndodano jednostkę do czasu pracy Pulse\ndodano stan z czasem pracy Pulse jako czytelny ciąg znaków",
				"uk": "додано одиницю виміру температури Pulse і округлено до 0,1°C\nдодано одиницю виміру напруги акумулятора Pulse і округлено до 100мВ\nдодано одиницю виміру часу роботи Pulse\nдодано стан з часом роботи Pulse у вигляді читабельного рядка",
				"zh-cn": "添加单位到 Pulse 温度并四舍五入到 0.1°C\n添加单位到 Pulse 电池电压并四舍五入到 100mV\n添加单位到 Pulse 运行时间\n添加具有 Pulse 运行时间的状态为人类可读字符串"
			},
			"3.4.0": {
				"en": "add mode for local poll of Pulse data (#201)",
				"de": "Modus für lokale Abfrage von Pulse Daten hinzufügen (#201)",
				"ru": "добавить режим для локального опроса данных Pulse (#201)",
				"pt": "adicionar modo para sondagem local de dados Pulse (#201)",
				"nl": "modus toevoegen voor lokale polling van Pulse data (#201)",
				"fr": "ajouter un mode pour le sondage local des données Pulse (#201)",
				"it": "aggiungere una modalità per il sondaggio locale dei dati Pulse (#201)",
				"es": "añadir modo para sondeo local de datos Pulse (#201)",
				"pl": "dodaj tryb lokalnego sondowania danych Pulse (#201)",
				"uk": "додати режим для локального опитування даних Pulse (#201)",
				"zh-cn": "添加本地轮询 Pulse 数据模式 (#201)"
			},
			"3.2.0": {
				"en": "IMPORTANT: adapter components had been blocked by Tibber - you have to update!\nbump base dependencies\nadapter will use internal output states for calculator if none defined in configuration (#325)\nimplement first run mode in calculator to reduce system load\ninternal optimizations",
				"de": "WICHTIG: Adapterkomponenten wurden von Tibber blockiert - Sie müssen aktualisieren!\nBasisabhängigkeiten aktualisieren\nAdapter wird interne Ausgangszustände für den Rechner verwenden, wenn keine in der Konfiguration definiert sind (#325)\nErstlaufmodus im Rechner implementieren, um die Systemlast zu reduzieren\ninterne Optimierungen",
				"ru": "ВАЖНО: компоненты адаптера были заблокированы Tibber - вам нужно обновить!\nобновить основные зависимости\nадаптер будет использовать внутренние выходные состояния для калькулятора, если они не определены в конфигурации (#325)\nреализовать режим первого запуска в калькуляторе для уменьшения нагрузки на систему\nвнутренние оптимизации",
				"pt": "IMPORTANTE: os componentes do adaptador foram bloqueados pela Tibber - você precisa atualizar!\natualize as dependências básicas\no adaptador usará estados de saída internos para calculadora se nenhum definido na configuração (#325)\nimplementar o modo de primeira execução na calculadora para reduzir a carga do sistema\notimizações internas",
				"nl": "BELANGRIJK: adaptercomponenten zijn geblokkeerd door Tibber - je moet updaten!\nbasisafhankelijkheden bijwerken\nadapter zal interne uitvoerstatussen gebruiken voor de calculator als er geen zijn gedefinieerd in de configuratie (#325)\neerste run-modus implementeren in calculator om de systeembelasting te verminderen\ninterne optimalisaties",
				"fr": "IMPORTANT : les composants de l'adaptateur ont été bloqués par Tibber - vous devez mettre à jour !\nmettre à jour les dépendances de base\nl'adaptateur utilisera des états de sortie internes pour la calculatrice si aucun n'est défini dans la configuration (#325)\nimplémenter le mode premier démarrage dans la calculatrice pour réduire la charge du système\noptimisations internes",
				"it": "IMPORTANTE: i componenti dell'adattatore sono stati bloccati da Tibber - è necessario aggiornare!\naggiornare le dipendenze di base\nl'adattatore utilizzerà stati di uscita interni per la calcolatrice se nessuno è definito nella configurazione (#325)\nimplementare la modalità di primo avvio nella calcolatrice per ridurre il carico del sistema\nottimizzazioni interne",
				"es": "IMPORTANTE: ¡los componentes del adaptador han sido bloqueados por Tibber - tienes que actualizar!\nactualiza las dependencias base\nel adaptador utilizará estados de salida internos para la calculadora si no se define ninguno en la configuración (#325)\nimplementar el modo de primera ejecución en la calculadora para reducir la carga del sistema\noptimizaciones internas",
				"pl": "WAŻNE: komponenty adaptera zostały zablokowane przez Tibber - musisz zaktualizować!\nzaktualizować podstawowe zależności\nadapter będzie używał wewnętrznych stanów wyjściowych dla kalkulatora, jeśli żaden nie został zdefiniowany w konfiguracji (#325)\nzaimplementować tryb pierwszego uruchomienia w kalkulatorze, aby zmniejszyć obciążenie systemu\noptymalizacje wewnętrzne",
				"uk": "ВАЖЛИВО: компоненти адаптера були заблоковані Tibber - вам потрібно оновити!\nоновіть базові залежності\nадаптер буде використовувати внутрішні вихідні стани для калькулятора, якщо жоден не визначено в конфігурації (#325)\nреалізувати режим першого запуску в калькуляторі для зменшення навантаження на систему\nвнутрішні оптимізації",
				"zh-cn": "重要：适配器组件已被 Tibber 阻止 - 你必须更新！\n升级基础依赖项\n适配器将使用计算器的内部输出状态，如果配置中没有定义 (#325)\n在计算器中实现首次运行模式以减少系统负载\n内部优化"
			}
		},
		"messages": [
			{
				"condition": {
					"operand": "and",
					"rules": ["oldVersion<0.3.0", "newVersion>=0.3.0"]
				},
				"title": {
					"en": "Important notice!",
					"de": "Wichtiger Hinweis!",
					"ru": "Важное замечание!",
					"pt": "Notícia importante!",
					"nl": "Belangrijke mededeling!",
					"fr": "Avis important!",
					"it": "Avviso IMPORTANTE!",
					"es": "Noticia importante!",
					"pl": "Ważna uwaga!",
					"uk": "Погода!",
					"zh-cn": "重要通知!"
				},
				"text": {
					"en": "Configuration of Pulse live data feed has changed!! You have to reenable it in the configuration! Now you can enable or disable for each Home.",
					"de": "Die Konfiguration des Pulse Live-Datenfeeds hat sich geändert! Sie müssen es in der Konfiguration wieder aktivieren! Jetzt können Sie für jedes Zuhause aktivieren oder deaktivieren.",
					"ru": "Конфигурация базы данных Pulse изменилась! Вы должны восстановить его в конфигурации! Теперь вы можете включить или отключить для каждого дома.",
					"pt": "A configuração do feed de dados ao vivo do Pulse mudou! Você tem que reenable-lo na configuração! Agora você pode ativar ou desativar para cada casa.",
					"nl": "Vermomming van Pulse live gegevens is veranderd! Je moet het vergoeden in het vertrouwen. Nu kun je in staat zijn voor elk huis.",
					"fr": "Configuration du flux de données en direct Pulse a changé! Vous devez le réactiver dans la configuration ! Maintenant, vous pouvez activer ou désactiver pour chaque Maison.",
					"it": "La configurazione dell'alimentazione dei dati live Pulse è cambiata! Devi riattivarlo nella configurazione! Ora è possibile attivare o disattivare per ogni casa.",
					"es": "¡La configuración de los datos de Pulse en vivo ha cambiado! ¡Tienes que volver a habilitarlo en la configuración! Ahora usted puede habilitar o desactivar para cada hogar.",
					"pl": "Zmiana danych na żywo została zmieniona. Zrezygnujesz go w konfiguracji! Teraz możesz umieścić lub uwolnić każdy dom.",
					"uk": "Настроювання імпульсних живих даних змінено! Ви повинні змінити його в конфігурації! Тепер ви можете ввімкнути або вимкнути для кожного будинку.",
					"zh-cn": "皮尔西人生活数据集成已改变! 你们必须把它重新纳入组合! 现在,你可以为每一个家庭提供或可分割的东西。."
				},
				"level": "warn",
				"buttons": ["agree", "cancel"]
			},
			{
				"condition": {
					"operand": "and",
					"rules": ["oldVersion<1.8.0", "newVersion>=1.8.0"]
				},
				"title": {
					"en": "Important notice!",
					"de": "Wichtiger Hinweis!",
					"ru": "Важное замечание!",
					"pt": "Notícia importante!",
					"nl": "Belangrijke mededeling!",
					"fr": "Avis important!",
					"it": "Avviso IMPORTANTE!",
					"es": "Noticia importante!",
					"pl": "Ważna uwaga!",
					"uk": "Погода!",
					"zh-cn": "重要通知!"
				},
				"text": {
					"en": "Configuration of adapter has changed!! Please verify your settings for Tibber price data poll. And save the settings!!",
					"de": "Die Konfiguration des Adapters wurde geändert!! Überprüfen Sie bitte Ihre Einstellungen für die Tibber-Preisdatenabfrage. Und speichern Sie die Einstellungen!!",
					"ru": "Конфигурация адаптера была изменена!! Пожалуйста, проверьте ваши настройки для опроса ценовых данных Tibber. И сохраните настройки!!",
					"pt": "A configuração do adaptador foi alterada!! Por favor, verifique suas configurações para a pesquisa de dados de preços do Tibber. E salve as configurações!!",
					"nl": "De configuratie van de adapter is gewijzigd!! Controleer alstublieft uw instellingen voor de Tibber-prijsgegevens poll. En sla de instellingen op!!",
					"fr": "La configuration de l'adaptateur a été modifiée!! Veuillez vérifier vos paramètres pour l'interrogation des données de prix Tibber. Et sauvegardez les paramètres!!",
					"it": "La configurazione dell'adattatore è stata modificata!! Verifica le tue impostazioni per l'interrogazione dei dati sui prezzi di Tibber. E salva le impostazioni!!",
					"es": "¡¡La configuración del adaptador ha cambiado!! Por favor, verifique sus ajustes para la consulta de datos de precios de Tibber. ¡Y guarde la configuración!!",
					"pl": "Konfiguracja adaptera została zmieniona!! Proszę sprawdzić ustawienia dla sondowania danych cenowych Tibber. I zapisać ustawienia!!",
					"uk": "Конфігурація адаптера була змінена!! Будь ласка, перевірте ваші налаштування для опитування цінових даних Tibber. І збережіть налаштування!!"
				},
				"level": "warn",
				"buttons": ["agree", "cancel"]
			},
			{
				"condition": {
					"operand": "and",
					"rules": ["oldVersion<2.3.0", "newVersion>=2.3.0"]
				},
				"title": {
					"en": "Important notice!",
					"de": "Wichtiger Hinweis!",
					"ru": "Важное замечание!",
					"pt": "Notícia importante!",
					"nl": "Belangrijke mededeling!",
					"fr": "Avis important!",
					"it": "Avviso IMPORTANTE!",
					"es": "Noticia importante!",
					"pl": "Ważna uwaga!",
					"uk": "Погода!",
					"zh-cn": "重要通知!"
				},
				"text": {
					"en": "The behavior of the adapter has changed! Calculator channels of type 'smart battery buffer' will now switch outputs to 'OFF' only once, directly after setting the channel to Active=false.",
					"de": "Das Verhalten des Adapters hat sich geändert! Rechnerkanäle des Typs 'smart battery buffer' schalten die Ausgänge jetzt nur noch einmal auf 'AUS', direkt nachdem der Kanal auf Aktiv=false gesetzt wurde.",
					"ru": "Поведение адаптера изменилось! Каналы калькулятора типа 'smart battery buffer' теперь будут переключать выходы на 'ВЫКЛ' только один раз, непосредственно после установки канала на Active=false.",
					"pt": "O comportamento do adaptador mudou! Os canais da calculadora do tipo 'smart battery buffer' agora mudarão as saídas para 'DESATIVADO' apenas uma vez, imediatamente após definir o canal como Ativo=false.",
					"nl": "Het gedrag van de adapter is veranderd! Rekenmachinekanalen van het type 'smart battery buffer' schakelen de uitgangen nu slechts één keer uit naar 'UIT', direct nadat het kanaal is ingesteld op Actief=false.",
					"fr": "Le comportement de l'adaptateur a changé ! Les canaux de calculatrice de type 'smart battery buffer' basculeront désormais les sorties sur 'OFF' une seule fois, juste après avoir réglé le canal sur Actif=false.",
					"it": "Il comportamento dell'adattatore è cambiato! I canali della calcolatrice di tipo 'smart battery buffer' passeranno ora le uscite su 'OFF' solo una volta, subito dopo aver impostato il canale su Attivo=false.",
					"es": "¡El comportamiento del adaptador ha cambiado! Los canales de la calculadora de tipo 'smart battery buffer' ahora cambiarán las salidas a 'APAGADO' solo una vez, justo después de establecer el canal en Activo=false.",
					"pl": "Zachowanie adaptera zmieniło się! Kanały kalkulatora typu 'smart battery buffer' będą teraz przełączać wyjścia na 'WYŁ' tylko raz, bezpośrednio po ustawieniu kanału na Aktywny=false.",
					"uk": "Поведінка адаптера змінилась! Канали калькулятора типу 'smart battery buffer' тепер будуть перемикати виходи на 'ВИКЛ' тільки один раз, безпосередньо після встановлення каналу на Активний=false.",
					"zh-cn": "适配器行为已更改！'智能电池缓冲'类型的计算器通道现在将在将通道设置为Active=false后仅一次将输出切换到“关闭”。"
				},
				"level": "warn",
				"buttons": ["agree", "cancel"]
			}
		],
		"titleLang": {
			"en": "Tibber Link",
			"de": "Tibber Link",
			"ru": "Тиббер Ссылка",
			"pt": "Tibber Link",
			"nl": "Tibber Link",
			"fr": "Tibber Link",
			"it": "Tibber Link",
			"es": "Tibber Link",
			"pl": "Tibber Link",
			"uk": "Посилання",
			"zh-cn": "网络联系"
		},
		"desc": {
			"en": "Links Tibber API data to be used in ioBroker",
			"de": "Verknüpft Tibber API-Daten zur Verwendung in ioBroker",
			"ru": "Ссылки на данные Tibber API для использования в ioBroker",
			"pt": "Vincula os dados da API do Tibber para serem usados no ioBroker",
			"nl": "Koppelt Tibber API-gegevens om te worden gebruikt in ioBroker",
			"fr": "Liaisons des données de l'API Tibber à utiliser dans ioBroker",
			"it": "Collega i dati dell'API di Tibber da utilizzare in ioBroker",
			"es": "Enlaza los datos de la API de Tibber para ser utilizados en ioBroker",
			"pl": "Łączy dane z API Tibber do użycia w ioBroker",
			"uk": "Посилання на дані Tibber API для використання в ioBroker",
			"zh-cn": "连接Tibber API数据以在ioBroker中使用"
		},
		"authors": ["Hombach <TibberLink@homba.ch>"],
		"keywords": ["power", "energy", "Tibber"],
		"tier": 2,
		"licenseInformation": {
			"license": "GPL-3.0-only",
			"type": "free"
		},
		"platform": "Javascript/Node.js",
		"icon": "tibberlink.png",
		"enabled": true,
		"extIcon": "https://raw.githubusercontent.com/Hombach/ioBroker.tibberlink/main/admin/tibberlink.png",
		"readme": "https://github.com/Hombach/ioBroker.tibberlink/blob/main/README.md",
		"loglevel": "info",
		"mode": "daemon",
		"messagebox": true,
		"allowInit": true,
		"type": "energy",
		"compact": true,
		"connectionType": "cloud",
		"dataSource": "poll",
		"adminUI": {
			"config": "json"
		},
		"dependencies": [
			{
				"js-controller": ">=5.0.19"
			}
		],
		"globalDependencies": [
			{
				"admin": ">=5.1.28"
			}
		],
		"plugins": {
			"sentry": {
				"dsn": "https://06e51e8346a5411f99ac6b1533d1d0ea@o415875.ingest.sentry.io/4505569088765952"
			}
		}
	},
	"encryptedNative": ["TibberAPIToken", "tibberBridgePassword"],
	"protectedNative": ["TibberAPIToken", "tibberBridgePassword"],
	"native": {
		"TibberAPIToken": "",
		"HomesList": [
			{
				"feedActive": "false",
				"priceDataPollActive": "true",
				"homeID": "None available - restart adapter after entering token",
				"statsActive": "false",
				"numberConsHourly": 24,
				"numberConsDaily": 7,
				"numberConsWeekly": 4,
				"numberConsMonthly": 4,
				"numberConsAnnual": 2
			}
		],
		"CalculatorList": [
			{
				"chHomeID": "None available - restart adapter after entering token",
				"chType": "best cost",
				"chName": "Channel Name",
				"chActive": "false",
				"chTargetState": "choose your state to drive, like 0_userdata.0.example_state",
				"chValueOn": "true",
				"chValueOff": "false",
				"chTargetState2": "choose your second state to drive, like 0_userdata.0.example_state_2",
				"chValueOn2": "true",
				"chValueOff2": "false"
			}
		],
		"PulseList": [
			{
				"puName": "Pulse Local",
				"tibberBridgeUrl": "tibber-host",
				"tibberBridgePassword": "xxxx-xxxx",
				"tibberPulseLocalNodeId": 1
			}
		]
	},
	"objects": [],
	"instanceObjects": [
		{
			"_id": "info",
			"type": "channel",
			"common": {
				"name": "Information"
			},
			"native": {}
		},
		{
			"_id": "info.LastSentryLogDay",
			"type": "state",
			"common": {
				"role": "value",
				"name": "Last day of month for Sentry log",
				"type": "number",
				"unit": "",
				"read": true,
				"write": false,
				"def": 0
			},
			"native": {}
		},
		{
			"_id": "info.connection",
			"type": "state",
			"common": {
				"role": "indicator.connected",
				"name": "Device or service connected",
				"type": "boolean",
				"read": true,
				"write": false,
				"def": false
			},
			"native": {}
		}
	]
}
