{
    "DUMMY_CalculatorTab": "DUMMY",
    "LBL_CalculatorTab": "Rechnereinstellungen",
    "LBL_UseCalculator": "Verwenden Sie Automatisierungsrechnerkanäle",
    "LBL_CalculatorList": "Rechnerkanäle",
    "LBL_item_chHomeID": "Wählen Sie Kanal-Home-ID",
    "TTIP_item_chHomeID": "Wählen Sie das Haus aus, dem dieser Kanal zugeordnet werden soll.",
    "LBL_item_chType": "Kanaltyp",
    "TTIP_item_chType": "Wählen Sie den Operationstyp für den Kanal aus.",
    "LBL_item_chType_option_1": "beste Kosten",
    "LBL_item_chType_option_2": "beste Einzelstunden",
    "LBL_item_chType_option_3": "Bester Stundenblock",
    "LBL_item_chType_option_4": "Bester Kosten-LTF",
    "LBL_item_chType_option_5": "beste Einzelstunden LTF",
    "LBL_item_chType_option_6": "Beste Stunden blockieren LTF",
    "LBL_item_chType_option_7": "intelligenter Batteriepuffer",
    "LBL_item_chName": "Kanalname",
    "TTIP_item_chName": "Kanalname, um Ihre Bundesstaaten leichter identifizieren zu können.",
    "LBL_item_chTargetState": "Zielzustand",
    "TTIP_item_chTargetState": "Wählen Sie den Zielausgangszustand für diesen Kanal aus. Wenn keine angegeben wird, wird eine im Channel-Ordner erstellt.",
    "LBL_item_chValueOn": "Wert JA",
    "TTIP_item_chValueOn": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „wahr“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_item_chValueOff": "Wert NEIN",
    "TTIP_item_chValueOff": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „wahr“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_item_chTargetState2": "Zielzustand 2",
    "TTIP_item_chTargetState2": "Wählen Sie den zweiten Zielausgangszustand für diesen Kanal. Wenn keine angegeben wird, wird im Channel-Ordner ein neues erstellt.",
    "LBL_item_chValueOn2": "Wert JA 2",
    "TTIP_item_chValueOn2": "Die in den zweiten Ausgabezustand zu schreibenden Werte können als „Wert JA 2“ und „Wert NEIN 2“ definiert werden, beispielsweise „wahr“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_item_chValueOff2": "Wert NEIN 2",
    "TTIP_item_chValueOff2": "Die in den zweiten Ausgabezustand zu schreibenden Werte können als „Wert JA 2“ und „Wert NEIN 2“ definiert werden, beispielsweise „wahr“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_calculatorhelp1": "Kanäle können basierend auf einem entsprechenden benannten Status aktiviert oder deaktiviert werden.",
    "LBL_calculatorhelp2": "Alle Zustände eines Rechnerkanals werden in der Nähe der Heimatzustände positioniert und mit der Kanalnummer gekennzeichnet.",
    "LBL_calculatorhelp3": "Das Verhalten eines Kanals wird durch seinen Typ bestimmt: „Beste Kosten“, „Beste Einzelstunden“, „Bester Stundenblock“ oder „Intelligenter Batteriepuffer“.",
    "LBL_calculatorhelp4": "Jeder Kanal stellt als Ausgang einen externen Zustand zur Verfügung, der im Reiter „Einstellungen“ ausgewählt werden kann. Dieser Status könnte beispielsweise „0_userdata.0.example_state“ oder ein anderer beschreibbarer externer Status sein.",
    "LBL_calculatorhelp5": "Wenn kein externer Ausgangszustand ausgewählt ist, wird ein interner Zustand innerhalb des Kanalbereichs generiert.",
    "LBL_calculatorhelp6": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „wahr“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_calculatorhelp7": "<b>Ausgaben:</b> Die folgenden Ausgabeparameter sind definiert:",
    "LBL_calculatorhelp8": "„Beste Kosten“: Verwendet das „TriggerPrice“-Objekt als Eingabe und generiert jede Stunde eine „YES“-Ausgabe, wenn die aktuellen Tibber-Energiekosten unter dem Triggerpreis liegen.",
    "LBL_calculatorhelp9": "„Beste einzelne Stunden“: Erzeugt während der günstigsten Stunden eine „JA“-Ausgabe mit der im „AmountHours“-Objekt definierten Stundenzahl.",
    "LBL_calculatorhelp10": "„Bester Stundenblock“: Gibt „JA“ während des kostengünstigsten Stundenblocks aus, mit der im „AmountHours“-Objekt angegebenen Dauer.",
    "LBL_calculatorhelp11": "„Beste Kosten LTF“: „Beste Kosten“ innerhalb eines begrenzten Zeitrahmens (LTF).",
    "LBL_calculatorhelp12": "„Beste Einzelstunden LTF“: „Beste Einzelstunden“ innerhalb eines begrenzten Zeitrahmens (LTF).",
    "LBL_calculatorhelp13": "„Beste Stunden-Block LTF“: „Beste Stunden-Block“ innerhalb eines begrenzten Zeitrahmens (LTF)",
    "LBL_calculatorhelp14": "„Smart Battery Buffer“: Verwendet den Parameter „EfficiencyLoss“, um den Effizienzverlust des Batteriesystems anzugeben. Der Parameter „AmountHours“ definiert die gewünschte Stundenzahl für die Batterieladung. Der Rechner aktiviert während der angegebenen „AmountHours“ der günstigsten Stunden die Batterieladung ('Wert JA') und deaktiviert die Batteriespeisung ('Wert 2 NEIN'). Umgekehrt wird in den Stunden mit den höchsten Kosten die Batterieladung deaktiviert („Wert NEIN“) und die Batteriespeisung aktiviert („Wert 2 JA“), sofern die Kosten den höchsten Gesamtpreis unter den günstigsten Stunden übersteigen. Während der restlichen Normalstunden, in denen eine Energiepufferung durch die Batterie wirtschaftlich nicht sinnvoll ist, werden beide Ausgänge abgeschaltet.",
    "LBL_calculatorhelp15": "<b>LTF-Kanäle:</b> Diese funktionieren ähnlich wie Standardkanäle, sind jedoch nur innerhalb eines durch die Statusobjekte „StartTime“ und „StopTime“ definierten Zeitrahmens aktiv. Nach „StopTime“ wird der Kanal automatisch deaktiviert. „StartTime“ und „StopTime“ können sich über zwei Kalendertage erstrecken, da Tibber keine Daten über ein 48-Stunden-Fenster hinaus bereitstellt. Beide Zustände erfordern eine Datums-/Uhrzeitzeichenfolge im ISO-8601-Format mit einem Zeitzonenversatz, z. B. „2024-12-24T18:00:00.000+01:00“.",
    "LBL_calculatorhelp16": "Darüber hinaus enthalten die LTF-Kanäle einen neuen Statusparameter namens „RepeatDays“, der standardmäßig 0 ist. Wenn „RepeatDays“ auf eine positive Ganzzahl gesetzt ist, wiederholt der Kanal seinen Zyklus, indem er sowohl „StartTime“ als auch „StopTime“ um die angegebene Zahl erhöht Tage nach Erreichen von „StopTime“. Setzen Sie beispielsweise „RepeatDays“ für eine tägliche Wiederholung auf 1."
}
