{
    "DUMMY_CalculatorTab": "ATRAPA",
    "LBL_CalculatorTab": "Ustawienia kalkulatora",
    "LBL_UseCalculator": "Skorzystaj z kanałów kalkulatora automatyzacji",
    "LBL_CalculatorList": "Kanały kalkulatora",
    "LBL_item_chHomeID": "Wybierz identyfikator główny kanału",
    "TTIP_item_chHomeID": "Wybierz dom, do którego ma być podłączony ten kanał.",
    "LBL_item_chType": "Typ kanału",
    "TTIP_item_chType": "Wybierz typ operacji dla kanału.",
    "LBL_item_chType_option_1": "najlepszy koszt",
    "LBL_item_chType_option_2": "najlepsze pojedyncze godziny",
    "LBL_item_chType_option_3": "blok najlepszych godzin",
    "LBL_item_chType_option_4": "najlepszy koszt LTF",
    "LBL_item_chType_option_5": "najlepsze pojedyncze godziny LTF",
    "LBL_item_chType_option_6": "blok najlepszych godzin LTF",
    "LBL_item_chType_option_7": "inteligentny bufor baterii",
    "LBL_item_chName": "Nazwa kanału",
    "TTIP_item_chName": "Nazwa kanału ułatwiająca identyfikację stanów.",
    "LBL_item_chTargetState": "Stan docelowy",
    "TTIP_item_chTargetState": "Wybierz docelowy stan wyjścia dla tego kanału. Jeśli nie zostanie podany żaden, zostanie on utworzony w folderze Kanał.",
    "LBL_item_chValueOn": "Wartość TAK",
    "TTIP_item_chValueOn": "Wartości zapisywane do stanu wyjściowego można zdefiniować jako „wartość TAK” i „wartość NIE”, na przykład „prawda” dla stanów boolowskich lub liczba lub tekst do zapisania.",
    "LBL_item_chValueOff": "Wartość nr",
    "TTIP_item_chValueOff": "Wartości zapisywane do stanu wyjściowego można zdefiniować jako „wartość TAK” i „wartość NIE”, na przykład „prawda” dla stanów boolowskich lub liczba lub tekst do zapisania.",
    "LBL_item_chTargetState2": "Stan docelowy 2",
    "TTIP_item_chTargetState2": "Wybierz drugi docelowy stan wyjścia dla tego kanału. Jeśli nie zostanie podany żaden, nowy zostanie utworzony w folderze Kanał.",
    "LBL_item_chValueOn2": "Wartość TAK 2",
    "TTIP_item_chValueOn2": "Wartości zapisywane na drugi stan wyjścia można zdefiniować jako „wartość TAK 2” i „wartość NIE 2”, np. „prawda” dla stanów boolowskich lub liczba lub tekst do zapisania.",
    "LBL_item_chValueOff2": "Wartość nr 2",
    "TTIP_item_chValueOff2": "Wartości zapisywane na drugi stan wyjścia można zdefiniować jako „wartość TAK 2” i „wartość NIE 2”, np. „prawda” dla stanów boolowskich lub liczba lub tekst do zapisania.",
    "LBL_calculatorhelp1": "Kanały można aktywować lub dezaktywować w oparciu o odpowiedni nazwany stan.",
    "LBL_calculatorhelp2": "Wszystkie stany kanału kalkulatora są umieszczone w pobliżu stanów macierzystych i są oznaczone numerem kanału.",
    "LBL_calculatorhelp3": "Zachowanie kanału zależy od jego typu: „Najlepszy koszt”, „Najlepsze pojedyncze godziny”, „Blok najlepszych godzin” lub „Inteligentny bufor baterii”.",
    "LBL_calculatorhelp4": "Każdy kanał udostępnia jako wyjście stan zewnętrzny, który można wybrać w zakładce ustawień. Tym stanem może być na przykład „0_userdata.0.example_state” lub dowolny inny zapisywalny stan zewnętrzny.",
    "LBL_calculatorhelp5": "Jeżeli nie zostanie wybrany stan wyjścia zewnętrznego, zostanie wygenerowany stan wewnętrzny w zakresie kanału.",
    "LBL_calculatorhelp6": "Wartości, które mają być zapisywane w stanie wyjściowym, można zdefiniować jako „wartość TAK” i „wartość NIE”, na przykład „prawda” w przypadku stanów boolowskich lub liczba lub tekst do zapisania.",
    "LBL_calculatorhelp7": "<b>Wyjścia:</b> zdefiniowano następujące parametry wyjściowe:",
    "LBL_calculatorhelp8": "„Najlepszy koszt”: Używa obiektu „TriggerPrice” jako danych wejściowych, generując wynik „TAK” co godzinę, gdy bieżący koszt energii Tibbera jest niższy od ceny wyzwalającej.",
    "LBL_calculatorhelp9": "„Najlepsze pojedyncze godziny”: Generuje wynik „TAK” w najtańszych godzinach, z liczbą godzin zdefiniowaną w obiekcie „AmountHours”.",
    "LBL_calculatorhelp10": "„Blok najlepszych godzin”: Wyświetla „TAK” podczas najbardziej opłacalnego bloku godzin, o czasie trwania określonym w obiekcie „AmountHours”.",
    "LBL_calculatorhelp11": "„Najlepszy koszt LTF”: „Najlepszy koszt” w ograniczonych ramach czasowych (LTF).",
    "LBL_calculatorhelp12": "„Najlepsze pojedyncze godziny LTF”: „Najlepsze pojedyncze godziny” w ograniczonych ramach czasowych (LTF).",
    "LBL_calculatorhelp13": "„Blok najlepszych godzin LTF”: „Blok najlepszych godzin” w ograniczonych ramach czasowych (LTF)",
    "LBL_calculatorhelp14": "„Inteligentny bufor baterii”: wykorzystuje parametr „EfficiencyLoss” do określenia utraty wydajności systemu baterii. Parametr „AmountHours” określa żądaną liczbę godzin ładowania akumulatora. Kalkulator aktywuje ładowanie akumulatora („wartość TAK”) i dezaktywuje zasilanie akumulatora („wartość 2 NIE”) w określonych „AmountHours” najtańszych godzinach. I odwrotnie, wyłączy ładowanie akumulatora („wartość NIE”) i włączy zasilanie akumulatora („wartość 2 TAK”) w godzinach o najwyższym koszcie, pod warunkiem, że koszt przekroczy najwyższą cenę łączną wśród najtańszych godzin. W pozostałych normalnych godzinach, gdy buforowanie energii przez akumulator nie jest ekonomicznie opłacalne, oba wyjścia zostaną wyłączone.",
    "LBL_calculatorhelp15": "<b>Kanały LTF:</b> Działają podobnie do kanałów standardowych, ale są aktywne tylko w przedziale czasowym zdefiniowanym przez obiekty stanu „StartTime” i „StopTime”. Po upływie „StopTime” kanał automatycznie się dezaktywuje. „StartTime” i „StopTime” mogą obejmować dwa dni kalendarzowe, ponieważ Tibber nie dostarcza danych wykraczających poza 48-godzinny okres. Obydwa stany wymagają ciągu daty i godziny w formacie ISO-8601 z przesunięciem strefy czasowej, np. „2024-12-24T18:00:00.000+01:00”.",
    "LBL_calculatorhelp16": "Dodatkowo kanały LTF zawierają nowy parametr stanu o nazwie „RepeatDays”, którego wartość domyślna wynosi 0. Gdy parametr „RepeatDays” jest ustawiony na dodatnią liczbę całkowitą, kanał powtarza swój cykl, zwiększając zarówno „StartTime”, jak i „StopTime” o określoną liczbę dni po osiągnięciu „StopTime”. Na przykład ustaw „RepeatDays” na 1, aby powtarzać codziennie.",
    "DUMMY_StandardTab": "ATRAPA",
    "LBL_SpecialsTab": "Ustawienia specjalne",
    "LBL_UseObsoleteStats": "Użyj przestarzałego wywołania API w celu uzyskania historycznych danych dotyczących zużycia - postępuj ostrożnie!",
    "LBL_specialshelp1": "Pobiera również wartości TotalCost, w tym specjalne opłaty sieciowe w Niemczech. Sprawdź wartości z tymi wyświetlanymi w aplikacji Tibber.",
    "LBL_LocalPulseTab": "Ustawienia lokalnego sondażu pulsu",
    "LBL_item_UseLocalPulseData": "Skorzystaj z bezpośredniego odpytywania lokalnych impulsów Tibbera – zachowaj ostrożność!",
    "LBL_item_localpulsehelp1": "Użyj mostków Tibber Bridge do bezpośredniego sondowania danych z modułów Tibber Pulse lokalnie.",
    "LBL_item_localpulsehelp2": "Aby to zadziałało, musisz zmodyfikować interfejs sieciowy Bridge, aby był stale włączony.",
    "LBL_item_localpulsehelp3": "marq24 dostarczył tutaj doskonały opis, jak to zrobić w przypadku integracji z Home Assistant:",
    "LBL_item_localpulsehelp4": "https://github.com/marq24/ha-tibber-pulse-local",
    "LBL_PulseList": "Local Pulse do odpytywania danych z:",
    "LBL_item_tibberBridgeUrl": "Adres sieciowy mostu",
    "TTIP_item_tibberBridgeUrl": "Nazwa Twojego mostu lub jego adres IP (domyślnie „tibber-host”).",
    "LBL_item_tibberBridgePassword": "Hasło mostu",
    "TTIP_item_tibberBridgePassword": "Hasło do lokalnego mostu Tibber Bridge, podane na sprzęcie.",
    "LBL_item_tibberPulseLocalNodeId": "Impulsowy identyfikator węzła",
    "TTIP_item_tibberPulseLocalNodeId": "Identyfikator węzła, w którym Twój Pulse jest zarejestrowany na moście.",
    "LBL_item_tibberBridgeRawDataInterval": "Interwał ankiety",
    "TTIP_item_tibberBridgeRawDataInterval": "Interwał w milisekundach odpytywania danych Bridge for Pulse."
}
