{
    "LBL_StandardTab": "Стандартные настройки",
    "LBL_TibberAPIToken": "Токен API Тиббера",
    "LBL_referralLink": "Если вы еще не являетесь пользователем Tibber, я был бы очень признателен, если бы вы использовали мою реферальную ссылку.",
    "LBL_HomesList": "Конфигурация потоков импульсных данных в реальном времени",
    "LBL_item_homeID": "Тиббер Хоум",
    "TTIP_item_homeID": "Идентификатор этого дома в Тиббере",
    "LBL_item_priceDataPollActive": "Используйте опрос данных о ценах на Тиббер",
    "TTIP_item_priceDataPollActive": "Используйте опрос ценовых данных Tibber",
    "LBL_item_feedActive": "Использовать импульсную подачу Tibber",
    "TTIP_item_feedActive": "Используйте канал Tibber Pulse для получения данных о потреблении в реальном времени.",
    "LBL_item_statsActive": "Получить исторические данные о потреблении",
    "TTIP_item_statsActive": "Получить исторические данные о потреблении для этого дома",
    "LBL_item_numberConsHourly": "Часы",
    "TTIP_item_numberConsHourly": "Количество прошлых часов, которые необходимо получить",
    "LBL_item_numberConsDaily": "Дни",
    "TTIP_item_numberConsDaily": "Количество прошлых дней, которые необходимо получить",
    "LBL_item_numberConsWeekly": "Недели",
    "TTIP_item_numberConsWeekly": "Количество прошлых недель, которые необходимо получить",
    "LBL_item_numberConsMonthly": "Месяцы",
    "TTIP_item_numberConsMonthly": "Количество прошлых месяцев, которые необходимо получить",
    "LBL_item_numberConsAnnual": "Годы",
    "TTIP_item_numberConsAnnual": "Количество прошлых лет, которые необходимо получить",
    "LBL_feedDataDetailHeader": "Выберите все поля, которые вы хотите загрузить в данные прямой трансляции (мощность и метка времени включены по умолчанию):",
    "LBL_phases": "Значения напряжения и тока. В случае нескольких счетчиков эти значения могут не быть включены в кадр данных, что может привести к нулевым значениям. Другие отклонения могут возникнуть в зависимости от конкретной прошивки счетчика. Нулевые значения не будут генерировать состояние в ваших объектах ioBroker.",
    "LBL_helpLink": "Показать документацию по адаптеру",
    "LBL_CalculatorTab": "Настройки калькулятора",
    "LBL_UseCalculator": "Используйте каналы калькулятора автоматизации",
    "LBL_CalculatorList": "Калькулятор каналов",
    "LBL_item_chHomeID": "Выберите домашний идентификатор канала",
    "TTIP_item_chHomeID": "Выберите дом, к которому должен быть привязан этот канал.",
    "LBL_item_chType": "Тип канала",
    "TTIP_item_chType": "Выберите тип операции для канала.",
    "LBL_item_chType_option_1": "лучшая цена",
    "LBL_item_chType_option_2": "лучшие одиночные часы",
    "LBL_item_chType_option_3": "блок лучших часов",
    "LBL_item_chType_option_4": "лучшая стоимость LTF",
    "LBL_item_chType_option_5": "лучшие одиночные часы LTF",
    "LBL_item_chType_option_6": "блок лучших часов LTF",
    "LBL_item_chType_option_7": "умный буфер батареи",
    "LBL_item_chType_option_8": "лучший процент",
    "LBL_item_chType_option_9": "лучший процент LTF",
    "LBL_item_chName": "Название канала",
    "TTIP_item_chName": "Название канала, которое поможет вам легче идентифицировать ваши состояния.",
    "LBL_item_chTargetState": "Целевое состояние",
    "TTIP_item_chTargetState": "Выберите целевое состояние выхода для этого канала. Если ничего не указано, он будет создан в папке «Канал».",
    "LBL_item_chValueOn": "Значение ДА",
    "TTIP_item_chValueOn": "Значения, которые должны быть записаны в выходное состояние, могут быть определены как «значение ДА» и «значение НЕТ», например, «истина» для логических состояний или число или текст для записи.",
    "LBL_item_chValueOff": "Значение НЕТ",
    "TTIP_item_chValueOff": "Значения, которые должны быть записаны в выходное состояние, могут быть определены как «значение ДА» и «значение НЕТ», например, «истина» для логических состояний или число или текст для записи.",
    "LBL_item_chTargetState2": "Целевое состояние 2",
    "TTIP_item_chTargetState2": "Выберите второе целевое состояние выхода для этого канала. Если ничего не указано, в папке «Канал» будет создан новый.",
    "LBL_item_chValueOn2": "Значение ДА 2",
    "TTIP_item_chValueOn2": "Значения, которые должны быть записаны во второе выходное состояние, могут быть определены как «значение ДА 2» и «значение НЕТ 2», например, «истина» для логических состояний или число или текст для записи.",
    "LBL_item_chValueOff2": "Значение № 2",
    "TTIP_item_chValueOff2": "Значения, которые должны быть записаны во второе выходное состояние, могут быть определены как «значение ДА 2» и «значение НЕТ 2», например, «истина» для логических состояний или число или текст для записи.",
    "LBL_calculatorhelp1": "Каналы можно активировать или деактивировать на основе соответствующего именованного состояния.",
    "LBL_calculatorhelp2": "Все состояния канала калькулятора располагаются рядом с исходными состояниями и помечаются номером канала.",
    "LBL_calculatorhelp3": "Поведение канала определяется его типом: «Лучшая стоимость», «Лучшие отдельные часы», «Блок лучших часов» или «Умный буфер батареи».",
    "LBL_calculatorhelp4": "Каждый канал предоставляет внешнее состояние в качестве выхода, которое можно выбрать на вкладке настроек. Это состояние может быть, например, «0_userdata.0.example_state» или любым другим доступным для записи внешним состоянием.",
    "LBL_calculatorhelp5": "Если внешнее состояние выхода не выбрано, будет сгенерировано внутреннее состояние в пределах диапазона канала.",
    "LBL_calculatorhelp6": "Значения, которые должны быть записаны в выходное состояние, могут быть определены как «значение ДА» и «значение НЕТ», например «истина» для логических состояний или число или текст для записи.",
    "LBL_calculatorhelp7": "<b>Выходы:</b> Определены следующие выходные параметры:",
    "LBL_calculatorhelp8": "«Лучшая стоимость»: использует объект «TriggerPrice» в качестве входных данных, генерируя выходной сигнал «ДА» каждый час, когда текущая стоимость энергии Tibber ниже триггерной цены.",
    "LBL_calculatorhelp9": "«Лучшие отдельные часы»: генерирует вывод «ДА» в течение самых дешевых часов, при этом количество часов определяется в объекте «AmountHours».",
    "LBL_calculatorhelp10": "«Блок лучших часов»: выводит «ДА» в течение наиболее экономически эффективного блока часов, продолжительность которого указана в объекте «AmountHours».",
    "LBL_calculatorhelp11": "«Лучшая стоимость LTF»: «Лучшая стоимость» в течение ограниченного периода времени (LTF).",
    "LBL_calculatorhelp12": "«Лучшие отдельные часы LTF»: «Лучшие отдельные часы» в течение ограниченного периода времени (LTF).",
    "LBL_calculatorhelp13": "«Блок лучших часов LTF»: «Блок лучших часов» в ограниченном временном интервале (LTF).",
    "LBL_calculatorhelp14": "«Интеллектуальный буфер батареи»: использует параметр «EfficiencyLoss», чтобы указать потерю эффективности аккумуляторной системы. Параметр AmountHours определяет желаемое количество часов для зарядки аккумулятора. Калькулятор активирует зарядку аккумулятора («значение ДА») и деактивирует питание аккумулятора («значение 2 НЕТ») в течение указанного «AmountHours» самых дешевых часов. И наоборот, он отключит зарядку аккумулятора («значение НЕТ») и активирует питание аккумулятора («значение 2 ДА») в часы с наибольшей стоимостью, при условии, что стоимость превышает самую высокую общую стоимость среди самых дешевых часов. В остальные часы работы, когда буферизация энергии с помощью батареи экономически нецелесообразна, оба выхода будут отключены.",
    "LBL_calculatorhelp15": "«Лучший процент»: выводит «ДА» в течение часа с наименьшими затратами и любых других часов, когда цена попадает в процентный диапазон, указанный в состоянии настроек «Процент».",
    "LBL_calculatorhelp16": "«Лучший процент LTF»: «Лучший процент» в течение ограниченного периода времени (LTF).",
    "LBL_calculatorhelp17": "<b>Каналы LTF:</b> Они функционируют аналогично стандартным каналам, но активны только в течение периода времени, определенного объектами состояния «StartTime» и «StopTime». После StopTime канал автоматически отключается. «StartTime» и «StopTime» могут охватывать два календарных дня, поскольку Тиббер не предоставляет данные за пределами 48-часового окна. Для обоих состояний требуется строка даты и времени в формате ISO-8601 со смещением часового пояса, например, «2024-12-24T18:00:00.000+01:00».",
    "LBL_calculatorhelp18": "Кроме того, каналы LTF включают новый параметр состояния под названием «RepeatDays», который по умолчанию равен 0. Когда для параметра «RepeatDays» установлено положительное целое число, канал повторяет свой цикл, увеличивая «StartTime» и «StopTime» на указанное число. дней после достижения StopTime. Например, установите для параметра «RepeatDays» значение 1 для ежедневного повторения.",
    "LBL_SpecialsTab": "Специальные настройки",
    "LBL_UseObsoleteStats": "Используйте устаревший вызов API для получения исторических данных о потреблении — действуйте осторожно!",
    "LBL_specialshelp1": "Также извлекаются значения TotalCost, включая специальные сборы за энергосистему в Германии. Пожалуйста, сверьте значения со значениями, указанными в вашем приложении Tibber.",
    "LBL_LocalPulseTab": "Настройки локального опроса импульсов",
    "LBL_item_UseLocalPulseData": "Используйте прямой опрос локальных импульсов Tibber — действуйте осторожно!",
    "LBL_item_localpulsehelp1": "Используйте мосты Tibber для прямого опроса данных с модулей Tibber Pulse локально.",
    "LBL_item_localpulsehelp2": "Чтобы это заработало, вам необходимо изменить веб-интерфейс Bridge, чтобы он оставался включенным постоянно.",
    "LBL_item_localpulsehelp3": "marq24 предоставил отличное описание того, как это сделать для интеграции Home Assistant:",
    "LBL_item_localpulsehelp4": "https://github.com/marq24/ha-tibber-pulse-local",
    "LBL_PulseList": "Local Pulse для опроса данных из:",
    "LBL_item_tibberBridgeUrl": "Сетевой адрес моста",
    "TTIP_item_tibberBridgeUrl": "Имя вашего моста или его IP-адрес (по умолчанию «tibber-host»).",
    "LBL_item_tibberBridgePassword": "Пароль моста",
    "TTIP_item_tibberBridgePassword": "Пароль для вашего локального Tibber Bridge, предусмотренный на оборудовании.",
    "LBL_item_tibberPulseLocalNodeId": "Идентификатор импульсного узла",
    "TTIP_item_tibberPulseLocalNodeId": "Идентификатор узла, на котором ваш Pulse зарегистрирован на мосту.",
    "LBL_item_tibberBridgeRawDataInterval": "Интервал опроса",
    "TTIP_item_tibberBridgeRawDataInterval": "Интервал в миллисекундах для опроса вашего моста на предмет импульсных данных.",
    "TXT_Stuctured Data Output": "Структурированный вывод данных",
    "LBL_EChartsLink": "Информацию о том, как использовать ECharts, можно найти по этой ссылке.",
    "LBL_FlexChartsLink": "Информацию о том, как использовать ioBroker FlexCharts, можно найти по этой ссылке."
}
