{
    "LBL_CalculatorList": "Rechnerkanäle",
    "LBL_CalculatorTab": "Rechnereinstellungen",
    "LBL_EChartsLink": "Informationen zur Verwendung von ECharts finden Sie unter diesem Link",
    "LBL_FlexChartsLink": "Informationen zur Verwendung von ioBroker FlexCharts finden Sie unter diesem Link",
    "LBL_GraphsTab": "Einstellungen für die Diagrammausgabe",
    "LBL_HomesList": "Konfiguration von Pulse-Live-Datenströmen",
    "LBL_LocalPulseTab": "Einstellungen für die lokale Pulsumfrage",
    "LBL_PulseList": "Local Pulse zum Abfragen von Daten von:",
    "LBL_StandardTab": "Standardeinstellungen",
    "LBL_TibberAPIToken": "Tibber-API-Token",
    "LBL_UseCalculator": "Verwenden Sie Automatisierungsrechnerkanäle",
    "LBL_calculatorhelp1": "Kanäle können basierend auf einem entsprechenden benannten Status aktiviert oder deaktiviert werden.",
    "LBL_calculatorhelp10": "„Bester Stundenblock“: Gibt „JA“ während des kostengünstigsten Stundenblocks aus, mit der im „AmountHours“-Objekt angegebenen Dauer.",
    "LBL_calculatorhelp11": "„Beste Kosten LTF“: „Beste Kosten“ innerhalb eines begrenzten Zeitrahmens (LTF).",
    "LBL_calculatorhelp12": "„Beste Einzelstunden LTF“: „Beste Einzelstunden“ innerhalb eines begrenzten Zeitrahmens (LTF).",
    "LBL_calculatorhelp13": "„Bester Stundenblock LTF“: „Beste Stunden-Block“ innerhalb eines begrenzten Zeitrahmens (LTF)",
    "LBL_calculatorhelp14": "„Intelligenter Batteriepuffer“: Verwendet den Parameter „EfficiencyLoss“, um den Effizienzverlust des Batteriesystems anzugeben. Der Parameter „AmountHours“ definiert die gewünschte Stundenzahl für die Batterieladung. Der Rechner aktiviert während der angegebenen „AmountHours“ der günstigsten Stunden die Batterieladung ('Wert JA') und deaktiviert die Batteriespeisung ('Wert 2 NEIN'). Umgekehrt wird in den Stunden mit den höchsten Kosten die Batterieladung deaktiviert („Wert NEIN“) und die Batteriespeisung aktiviert („Wert 2 JA“), sofern die Kosten den höchsten Gesamtpreis unter den günstigsten Stunden übersteigen. Während der restlichen Normalstunden, in denen eine Energiepufferung durch die Batterie wirtschaftlich nicht sinnvoll ist, werden beide Ausgänge abgeschaltet.",
    "LBL_calculatorhelp15": "„Bester Prozentsatz“: Gibt „JA“ während der günstigsten Stunde und allen anderen Stunden aus, in denen der Preis innerhalb des im Einstellungsstatus „Prozentsatz“ angegebenen Prozentbereichs liegt.",
    "LBL_calculatorhelp16": "„Bester Prozentsatz LTF“: „Bester Prozentsatz“ innerhalb eines begrenzten Zeitrahmens (LTF).",
    "LBL_calculatorhelp17": "<b>LTF-Kanäle:</b> Diese funktionieren ähnlich wie Standardkanäle, sind jedoch nur innerhalb eines durch die Statusobjekte „StartTime“ und „StopTime“ definierten Zeitrahmens aktiv. Nach „StopTime“ wird der Kanal automatisch deaktiviert. „StartTime“ und „StopTime“ können sich über zwei Kalendertage erstrecken, da Tibber keine Daten über ein 48-Stunden-Fenster hinaus bereitstellt. Beide Zustände erfordern eine Datums-/Uhrzeitzeichenfolge im ISO-8601-Format mit einem Zeitzonenversatz, z. B. „2024-12-24T18:00:00.000+01:00“.",
    "LBL_calculatorhelp18": "Darüber hinaus enthalten die LTF-Kanäle einen neuen Statusparameter namens „RepeatDays“, der standardmäßig 0 ist. Wenn „RepeatDays“ auf eine positive Ganzzahl gesetzt ist, wiederholt der Kanal seinen Zyklus, indem er sowohl „StartTime“ als auch „StopTime“ um die angegebene Zahl erhöht Tage nach Erreichen von „StopTime“. Setzen Sie beispielsweise „RepeatDays“ für eine tägliche Wiederholung auf 1.",
    "LBL_calculatorhelp2": "Alle Zustände eines Rechnerkanals werden in der Nähe der Heimatzustände positioniert und mit der Kanalnummer gekennzeichnet.",
    "LBL_calculatorhelp3": "Das Verhalten eines Kanals wird durch seinen Typ bestimmt: „Beste Kosten“, „Beste Einzelstunden“, „Bester Stundenblock“ oder „Intelligenter Batteriepuffer“.",
    "LBL_calculatorhelp4": "Jeder Kanal stellt als Ausgang einen externen Zustand zur Verfügung, der im Reiter „Einstellungen“ ausgewählt werden kann. Dieser Status könnte beispielsweise „0_userdata.0.example_state“ oder ein anderer beschreibbarer externer Status sein.",
    "LBL_calculatorhelp5": "Wenn kein externer Ausgangszustand ausgewählt ist, wird ein interner Zustand innerhalb des Kanalbereichs generiert.",
    "LBL_calculatorhelp6": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „true“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "LBL_calculatorhelp7": "<b>Ausgaben:</b> Die folgenden Ausgabeparameter sind definiert:",
    "LBL_calculatorhelp8": "„Beste Kosten“: Verwendet das „TriggerPrice“-Objekt als Eingabe und generiert jede Stunde eine „YES“-Ausgabe, wenn die aktuellen Tibber-Energiekosten unter dem Triggerpreis liegen.",
    "LBL_calculatorhelp9": "„Beste Einzelstunden“: Erzeugt während der günstigsten Stunden eine „JA“-Ausgabe mit der im „AmountHours“-Objekt definierten Stundenzahl.",
    "LBL_chGraphEnabled": "JSON für die generierte Grafik",
    "LBL_feedDataDetailHeader": "Wählen Sie alle Felder aus, die Sie in die Live-Feed-Daten laden möchten (Leistung und Zeitstempel sind standardmäßig aktiviert):",
    "LBL_helpLink": "Adapterdokumentation anzeigen",
    "LBL_item_UseLocalPulseData": "Verwenden Sie die direkte Abfrage lokaler Tibber-Impulse – seien Sie vorsichtig!",
    "LBL_item_chHomeID": "Wählen Sie Kanal-Home-ID",
    "LBL_item_chName": "Kanalname",
    "LBL_item_chTargetState": "Zielzustand",
    "LBL_item_chTargetState2": "Zielzustand 2",
    "LBL_item_chType": "Kanaltyp",
    "LBL_item_chType_option_1": "Beste Kosten",
    "LBL_item_chType_option_2": "Beste Einzelstunden",
    "LBL_item_chType_option_3": "Bester Stundenblock",
    "LBL_item_chType_option_4": "Beste Kosten LTF",
    "LBL_item_chType_option_5": "Beste Einzelstunden LTF",
    "LBL_item_chType_option_6": "Bester Stundenblock LTF",
    "LBL_item_chType_option_7": "Intelligenter Batteriepuffer",
    "LBL_item_chType_option_8": "Bester Prozentsatz",
    "LBL_item_chType_option_9": "Bester Prozentsatz LTF",
    "LBL_item_chValueOff": "Wert NEIN",
    "LBL_item_chValueOff2": "Wert NEIN 2",
    "LBL_item_chValueOn": "Wert JA",
    "LBL_item_chValueOn2": "Wert JA 2",
    "LBL_item_feedActive": "Verwenden Sie Tibber Pulse Feed",
    "LBL_item_homeID": "Tibber-Home",
    "LBL_item_localpulsehelp1": "Verwenden Sie Ihre Tibber Bridge(s), um Daten direkt lokal von Ihren Tibber Pulse-Modul(en) abzufragen.",
    "LBL_item_localpulsehelp2": "Damit es funktioniert, müssen Sie die Weboberfläche der Bridge so ändern, dass sie dauerhaft aktiviert bleibt.",
    "LBL_item_localpulsehelp3": "marq24 hat hier eine hervorragende Beschreibung für seine HomeAssistant-Integration bereitgestellt:",
    "LBL_item_localpulsehelp4": "https://github.com/marq24/ha-tibber-pulse-local",
    "LBL_item_numberConsAnnual": "Jahre",
    "LBL_item_numberConsDaily": "Tage",
    "LBL_item_numberConsHourly": "Std",
    "LBL_item_numberConsMonthly": "Monate",
    "LBL_item_numberConsWeekly": "Wochen",
    "LBL_item_priceDataPollActive": "Nutzen Sie die Tibber-Preisdatenabfrage",
    "LBL_item_statsActive": "Historische Verbrauchsdaten abrufen",
    "LBL_item_tibberBridgePassword": "Bridge-Passwort",
    "LBL_item_tibberBridgeRawDataInterval": "Abfrageintervall",
    "LBL_item_tibberBridgeUrl": "Bridge-Netzwerkadresse",
    "LBL_item_tibberPulseLocalNodeId": "Pulse NodeID",
    "LBL_phases": "Spannungs- und Stromwerte – Bei mehreren Messgeräten sind diese Werte möglicherweise nicht im Datenrahmen enthalten, was möglicherweise zu Nullwerten führt. Abhängig von der spezifischen Firmware des Messgeräts können weitere Abweichungen auftreten. Nullwerte generieren keinen Status in Ihren ioBroker-Objekten.",
    "LBL_referralLink": "Wenn Sie noch kein Tibber-Benutzer sind, würde ich mich sehr freuen, wenn Sie meinen Empfehlungslink verwenden könnten.",
    "LBL_templateFlexGraph01": "Sie können diese Demo -Vorlage für Flexcharts verwenden. Kopieren Sie einfach den Code in den Editor ein.",
    "TTIP_chGraphEnabled": "Wether JSON gibt Grafiken wie Flexcharts aus",
    "TTIP_item_chHomeID": "Wählen Sie das Home aus, dem dieser Kanal zugeordnet werden soll.",
    "TTIP_item_chName": "Kanalname, um Ihre Bundesstaaten leichter identifizieren zu können.",
    "TTIP_item_chTargetState": "Wählen Sie den Zielausgangszustand für diesen Kanal aus. Wenn keine angegeben wird, wird eine im Channel-Ordner erstellt.",
    "TTIP_item_chTargetState2": "Wählen Sie den zweiten Zielausgangszustand für diesen Kanal. Wenn keine angegeben wird, wird im Channel-Ordner ein neues erstellt.",
    "TTIP_item_chType": "Wählen Sie den Operationstyp für den Kanal aus.",
    "TTIP_item_chValueOff": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „true“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "TTIP_item_chValueOff2": "Die in den zweiten Ausgabezustand zu schreibenden Werte können als „Wert JA 2“ und „Wert NEIN 2“ definiert werden, beispielsweise „true“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "TTIP_item_chValueOn": "Die in den Ausgabezustand zu schreibenden Werte können als „Wert JA“ und „Wert NEIN“ definiert werden, beispielsweise „true“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "TTIP_item_chValueOn2": "Die in den zweiten Ausgabezustand zu schreibenden Werte können als „Wert JA 2“ und „Wert NEIN 2“ definiert werden, beispielsweise „true“ für boolesche Zustände oder eine zu schreibende Zahl oder ein zu schreibender Text.",
    "TTIP_item_feedActive": "Verwenden Sie den Tibber Pulse-Feed für Live-Verbrauchsdaten",
    "TTIP_item_homeID": "Die ID dieses Tibber-Homes",
    "TTIP_item_numberConsAnnual": "Anzahl der vergangenen Jahre, die abgerufen werden sollen",
    "TTIP_item_numberConsDaily": "Anzahl der vergangenen Tage, die abgerufen werden sollen",
    "TTIP_item_numberConsHourly": "Anzahl der vergangenen Stunden, die abgerufen werden sollen",
    "TTIP_item_numberConsMonthly": "Anzahl der vergangenen Monate, die abgerufen werden sollen",
    "TTIP_item_numberConsWeekly": "Anzahl der vergangenen Wochen, die abgerufen werden sollen",
    "TTIP_item_priceDataPollActive": "Nutzen Sie die Tibber-Preisdatenabfrage",
    "TTIP_item_statsActive": "Rufen Sie historische Verbrauchsdaten für dieses Home ab",
    "TTIP_item_tibberBridgePassword": "Das Passwort für Ihre lokale Tibber Bridge, wie auf der Hardware angegeben.",
    "TTIP_item_tibberBridgeRawDataInterval": "Das Intervall (in Millisekunden) für die Abfrage Ihrer Bridge nach Pulse-Daten.",
    "TTIP_item_tibberBridgeUrl": "Name Ihrer Bridge oder ihre IP-Adresse (standardmäßig „tibber-host“).",
    "TTIP_item_tibberPulseLocalNodeId": "Die Knoten-ID, unter der Ihr Pulse auf der Bridge registriert ist."
}
