{
    "LBL_StandardTab": "Impostazioni standard",
    "LBL_TibberAPIToken": "Token API Tibber",
    "LBL_referralLink": "Se non sei ancora un utente Tibber, apprezzerei molto se potessi utilizzare il mio link di riferimento.",
    "LBL_HomesList": "Configurazione dei flussi di dati in tempo reale",
    "LBL_item_homeID": "Casa Tibber",
    "TTIP_item_homeID": "L'ID di questa casa di Tibber",
    "LBL_item_priceDataPollActive": "Utilizza il sondaggio sui dati sui prezzi di Tibber",
    "TTIP_item_priceDataPollActive": "Utilizza il sondaggio sui dati sui prezzi di Tibber",
    "LBL_item_feedActive": "Utilizzare l'alimentazione a impulsi Tibber",
    "TTIP_item_feedActive": "Utilizza il feed Tibber Pulse per i dati sul consumo in tempo reale",
    "LBL_item_statsActive": "Recuperare i dati storici sui consumi",
    "TTIP_item_statsActive": "Recupera i dati storici sul consumo di questa casa",
    "LBL_item_numberConsHourly": "Ore",
    "TTIP_item_numberConsHourly": "Numero di ore passate da recuperare",
    "LBL_item_numberConsDaily": "Giorni",
    "TTIP_item_numberConsDaily": "Numero di giorni passati da recuperare",
    "LBL_item_numberConsWeekly": "Settimane",
    "TTIP_item_numberConsWeekly": "Numero di settimane passate da recuperare",
    "LBL_item_numberConsMonthly": "Mesi",
    "TTIP_item_numberConsMonthly": "Numero di mesi passati da recuperare",
    "LBL_item_numberConsAnnual": "Anni",
    "TTIP_item_numberConsAnnual": "Numero di anni passati da recuperare",
    "LBL_feedDataDetailHeader": "Seleziona tutti i campi che desideri caricare nei dati del feed live (alimentazione e timestamp sono abilitati per impostazione predefinita):",
    "LBL_phases": "Valori di tensione e corrente: nel caso di più contatori, questi valori potrebbero non essere inclusi nel frame dati, risultando potenzialmente in valori nulli. Potrebbero verificarsi altre deviazioni a seconda del firmware specifico del misuratore. I valori null non genereranno uno stato nei tuoi oggetti ioBroker.",
    "LBL_helpLink": "Mostra la documentazione dell'adattatore",
    "LBL_CalculatorTab": "Impostazioni della calcolatrice",
    "LBL_UseCalculator": "Utilizza i canali del calcolatore di automazione",
    "LBL_CalculatorList": "Canali della calcolatrice",
    "LBL_item_chHomeID": "Seleziona ID casa canale",
    "TTIP_item_chHomeID": "Seleziona la casa a cui collegare questo canale.",
    "LBL_item_chType": "Tipo di canale",
    "TTIP_item_chType": "Selezionare il tipo di operazione per il canale.",
    "LBL_item_chType_option_1": "miglior costo",
    "LBL_item_chType_option_2": "le migliori ore singole",
    "LBL_item_chType_option_3": "blocco orari migliori",
    "LBL_item_chType_option_4": "miglior costo LTF",
    "LBL_item_chType_option_5": "miglior LTF a ore singole",
    "LBL_item_chType_option_6": "gli orari migliori bloccano LTF",
    "LBL_item_chType_option_7": "buffer intelligente della batteria",
    "LBL_item_chType_option_8": "percentuale migliore",
    "LBL_item_chType_option_9": "migliore percentuale LTF",
    "LBL_item_chName": "Nome del canale",
    "TTIP_item_chName": "Nome del canale per identificare più facilmente i tuoi stati.",
    "LBL_item_chTargetState": "Stato di destinazione",
    "TTIP_item_chTargetState": "Seleziona lo stato di uscita target per questo canale. Se non ne viene fornito nessuno, ne verrà creato uno all'interno della cartella Canale.",
    "LBL_item_chValueOn": "Valore SI",
    "TTIP_item_chValueOn": "I valori da scrivere nello stato di uscita possono essere definiti come \"valore SI\" e \"valore NO\", ad esempio \"vero\" per gli stati booleani oppure un numero o un testo da scrivere.",
    "LBL_item_chValueOff": "Valore NO",
    "TTIP_item_chValueOff": "I valori da scrivere nello stato di uscita possono essere definiti come \"valore SI\" e \"valore NO\", ad esempio \"vero\" per gli stati booleani oppure un numero o un testo da scrivere.",
    "LBL_item_chTargetState2": "Stato di destinazione 2",
    "TTIP_item_chTargetState2": "Selezionare il secondo stato di uscita target per questo canale. Se non ne viene fornito nessuno, ne verrà creato uno nuovo all'interno della cartella Canale.",
    "LBL_item_chValueOn2": "Valore SI 2",
    "TTIP_item_chValueOn2": "I valori da scrivere nel secondo stato di uscita possono essere definiti come \"valore SI 2\" e \"valore NO 2\", ad esempio \"vero\" per gli stati booleani oppure un numero o un testo da scrivere.",
    "LBL_item_chValueOff2": "Valore NO2",
    "TTIP_item_chValueOff2": "I valori da scrivere nel secondo stato di uscita possono essere definiti come \"valore SI 2\" e \"valore NO 2\", ad esempio \"vero\" per gli stati booleani oppure un numero o un testo da scrivere.",
    "LBL_calculatorhelp1": "I canali possono essere attivati ​​o disattivati ​​in base allo stato denominato corrispondente.",
    "LBL_calculatorhelp2": "Tutti gli stati di un canale della calcolatrice sono posizionati vicino agli stati home e sono etichettati con il numero del canale.",
    "LBL_calculatorhelp3": "Il comportamento di un canale è determinato dal suo tipo: \"Miglior costo\", \"Migliori ore singole\", \"Miglior blocco di ore\" o \"Buffer batteria intelligente\".",
    "LBL_calculatorhelp4": "Ciascun canale fornisce uno stato esterno come uscita, che può essere selezionato nella scheda delle impostazioni. Questo stato potrebbe essere, ad esempio, \"0_userdata.0.example_state\" o qualsiasi altro stato esterno scrivibile.",
    "LBL_calculatorhelp5": "Se non viene selezionato nessuno stato di uscita esterna, verrà generato uno stato interno all'interno dell'intervallo del canale.",
    "LBL_calculatorhelp6": "I valori da scrivere nello stato di uscita possono essere definiti come \"valore SI\" e \"valore NO\", ad esempio \"vero\" per gli stati booleani oppure un numero o un testo da scrivere.",
    "LBL_calculatorhelp7": "<b>Output:</b> sono definiti i seguenti parametri di output:",
    "LBL_calculatorhelp8": "'Miglior costo': utilizza l'oggetto 'TriggerPrice' come input, generando un output 'SÌ' ogni ora quando il costo energetico attuale di Tibber è inferiore al prezzo di attivazione.",
    "LBL_calculatorhelp9": "'Migliori ore singole': genera un output 'SÌ' durante le ore meno costose, con il numero di ore definito nell'oggetto 'AmountHours'.",
    "LBL_calculatorhelp10": "'Blocco di ore migliori': restituisce 'SÌ' durante il blocco di ore più conveniente, con la durata specificata nell'oggetto 'AmountHours'.",
    "LBL_calculatorhelp11": "\"Miglior costo LTF\": \"Miglior costo\" entro un intervallo di tempo limitato (LTF).",
    "LBL_calculatorhelp12": "\"Migliori ore singole LTF\": \"Migliori ore singole\" in un intervallo di tempo limitato (LTF).",
    "LBL_calculatorhelp13": "\"Blocco ore migliori LTF\": \"Blocco ore migliori\" entro un intervallo di tempo limitato (LTF)",
    "LBL_calculatorhelp14": "'Smart Battery Buffer': utilizza il parametro 'EfficiencyLoss' per specificare la perdita di efficienza del sistema batteria. Il parametro 'AmountHours' definisce il numero di ore desiderato per la ricarica della batteria. La calcolatrice attiverà la ricarica della batteria ('valore YES') e disattiverà l'alimentazione della batteria ('valore 2 NO') durante le 'AmountHours' specificate delle ore più economiche. Viceversa disattiverà la ricarica della batteria ('valore NO') e attiverà l'alimentazione della batteria ('valore 2 SI') nelle ore con costo più elevato, purché il costo superi il prezzo totale più alto tra le ore più economiche. Durante le restanti ore normali, in cui l'accumulo di energia da parte della batteria non è economicamente sostenibile, entrambe le uscite verranno disattivate.",
    "LBL_calculatorhelp15": "'Percentuale migliore': restituisce 'SÌ' durante l'ora meno costosa e qualsiasi altra ora in cui il prezzo rientra nell'intervallo percentuale specificato nello stato delle impostazioni 'Percentuale'.",
    "LBL_calculatorhelp16": "\"Migliore percentuale LTF\": \"Migliore percentuale\" entro un intervallo di tempo limitato (LTF).",
    "LBL_calculatorhelp17": "<b>Canali LTF:</b> funzionano in modo simile ai canali standard ma sono attivi solo entro un intervallo di tempo definito dagli oggetti di stato \"StartTime\" e \"StopTime\". Dopo \"StopTime\", il canale si disattiva automaticamente. \"StartTime\" e \"StopTime\" possono estendersi su due giorni di calendario, poiché Tibber non fornisce dati oltre una finestra di 48 ore. Entrambi gli stati richiedono una stringa data-ora in formato ISO-8601 con un offset del fuso orario, ad esempio \"2024-12-24T18:00:00.000+01:00\".",
    "LBL_calculatorhelp18": "Inoltre, i canali LTF includono un nuovo parametro di stato chiamato \"RepeatDays\", che per impostazione predefinita è 0. Quando \"RepeatDays\" è impostato su un numero intero positivo, il canale ripete il suo ciclo incrementando sia \"StartTime\" che \"StopTime\" del numero specificato di giorni dopo il raggiungimento di 'StopTime'. Ad esempio, imposta \"RepeatDays\" su 1 per la ripetizione quotidiana.",
    "LBL_SpecialsTab": "Impostazioni speciali",
    "LBL_UseObsoleteStats": "Utilizza la chiamata API obsoleta per i dati storici sul consumo: procedi con cautela!",
    "LBL_specialshelp1": "Recupera anche i valori TotalCost, incluse le tariffe di rete speciali in Germania. Verifica i valori con quelli mostrati nella tua app Tibber.",
    "LBL_LocalPulseTab": "Impostazioni sondaggio impulso locale",
    "LBL_item_UseLocalPulseData": "Utilizzare il polling diretto dei Tibber Pulse locali: procedere con cautela!",
    "LBL_item_localpulsehelp1": "Utilizza i tuoi Tibber Bridge per interrogare direttamente i dati dai tuoi moduli Tibber Pulse localmente.",
    "LBL_item_localpulsehelp2": "Per farlo funzionare, è necessario modificare l'interfaccia web del Bridge per mantenerlo permanentemente abilitato.",
    "LBL_item_localpulsehelp3": "marq24 ha fornito un'eccellente descrizione di come eseguire questa operazione per l'integrazione dell'Home Assistant qui:",
    "LBL_item_localpulsehelp4": "https://github.com/marq24/ha-tibber-pulse-local",
    "LBL_PulseList": "Impulso locale per interrogare i dati da:",
    "LBL_item_tibberBridgeUrl": "Indirizzo di rete del bridge",
    "TTIP_item_tibberBridgeUrl": "Nome del tuo Bridge o relativo indirizzo IP (il valore predefinito è \"tibber-host\").",
    "LBL_item_tibberBridgePassword": "Parola d'ordine del ponte",
    "TTIP_item_tibberBridgePassword": "La password per il tuo Tibber Bridge locale, come fornita sull'hardware.",
    "LBL_item_tibberPulseLocalNodeId": "ID nodo impulso",
    "TTIP_item_tibberPulseLocalNodeId": "L'ID del nodo in cui è registrato il tuo Pulse sul Bridge.",
    "LBL_item_tibberBridgeRawDataInterval": "Intervallo di sondaggio",
    "TTIP_item_tibberBridgeRawDataInterval": "L'intervallo, in millisecondi, per il polling dei dati Bridge for Pulse."
}
