{
	"s_StandardSettings": "Impostazioni standard",
	"s_ReferalLink": "Se al momento non sei un utente Tibber, apprezziamo molto se utilizzi il nostro link di riferimento.",
	"s_TibberAPIToken": "Token per l'API di Tibber",
	"s_HomesFeedTable": "Configurazione dei flussi di dati live di Pulse",
	"s_Home": "Casa Tibber",
	"s_PulseActive": "Utilizza Tibber Pulse per questa casa",
	"s_SelectFieldsForFeed": "Seleziona tutti i campi che desideri caricare nei dati del feed (potenza e timestamp sono i valori predefiniti):",
	"s_PhasesExplanation": "Valori di tensione e corrente - su diversi contatori questi valori non fanno parte del frame dati, quindi i valori potrebbero essere nulli. Potrebbero esserci altre deviazioni basate sul firmware del contatore concreto. I valori nulli non genereranno uno stato nei tuoi oggetti ioBroker.",
	"s_CalculatorSettings": "Impostazioni di automazione",
	"s_CalculatorChannels": "Canali di automazione",
	"s_UseCalculator": "Utilizza l'automazione",
	"s_ChannelHome": "Canale Casa",
	"s_ChannelType": "Tipo di canale",
	"s_BestCost": "Miglior costo",
	"s_BestSingleHours": "Migliori ore singole",
	"s_BestHoursBlock": "Miglior blocco di ore - Non implementato",
	"s_Active": "Attivo",
	"s_TargetState": "Stato obiettivo",
	"s_ValueYES": "Valore SI",
	"s_ValueNO": "Valore NO",
	"s_CalculatorHelp1": "I canali possono essere attivati o disattivati in uno Stato corrispondente.",
	"s_CalculatorHelp2": "Tutti gli stati di un canale del calcolatore sono posizionati vicino agli States delle case e denominati con il numero del canale.",
	"s_CalculatorHelp3": "Il comportamento di un canale è definito dal suo tipo: 'miglior costo'; 'migliori ore singole' - non ancora implementate; 'miglior blocco di ore' - non ancora implementato.",
	"s_CalculatorHelp4": "Ogni canale ha uno stato esterno come uscita, che può essere scelto nella scheda delle impostazioni. Questo stato potrebbe essere, ad esempio, '0_userdata.0.example_state' o qualsiasi altro stato esterno scrivibile.",
	"s_CalculatorHelp5": "I valori da scrivere nello stato di uscita possono essere definiti in 'valore SÌ' e 'valore NO', ad esempio 'true' per gli stati booleani, o un numero o un testo da scrivere.",
	"s_CalculatorHelp6": "Uscite:",
	"s_CalculatorHelp7": "'Miglior costo': Utilizza lo stato 'TriggerPrice' come ingresso - l'uscita è 'SÌ' ogni ora in cui il costo dell'energia Tibber attuale è inferiore al prezzo di scatto.",
	"s_CalculatorHelp8": "'Migliori ore singole' - non ancora implementate.",
	"s_CalculatorHelp9": "'Miglior blocco di ore' - non ancora implementato."
}
